

/******************************************************************************************************

位操作（左移，右移）

******************************************************************************************************/

#include <stdio.h>

int main(int argc, char const *argv[])
{
	int value = 1;
	while(value <1024)
	{
		value <<= 1;//左移1位x2
		printf("value = %d \n", value);
	}

	printf("\n-------------------------------------------\n");

	value = 1024;
	while(value >0)
	{
		value >>= 2;//右移1为/2
		printf("value = %d\n", value);
	}


	return 0;
}





